{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Action",
    "1": "Adventure",
    "2": "Comedy",
    "3": "Drama",
    "4": "Horror",
    "5": "Romance",
    "6": "Science Fiction"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Action": 0,
    "Adventure": 1,
    "Comedy": 2,
    "Drama": 3,
    "Horror": 4,
    "Romance": 5,
    "Science Fiction": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
